package W9_may27_tusk2;

/*
Завдання Фабрика

Створити програму яка буде описувати виробництво меблів на фабриці.

У нас будуть три варіанта меблів - Ар-деко, Вікторіанській і Модерн.

Фабрика вміє виробляти - Крісло, Диван, Столик.

Крісло, Диван, Столик - мають мати ціну - X.X, назву - "XXX".

Стпроектувати програму таким чином, щоб користувач міг вибрати який варіант меблів він хоче отримати і фабрика це
зробила. Після вибору він отримав докладний звіт.

Також передбачити умову - якщо у нас зʼявляється новий виріб - наприклад Поличка то фабрика яка виробляє меблі після
адаптації могла працювати далі і не зломати весь наш процес.

Наприклад

------------------

Який варіант набору Ви хотіли б придбати ?

1 -> Ар-деко
2 -> Вікторіанській
3 -> Модерн

------------------

Ви обрали варіант: 2

Детальний опис:

Крісло - "Тиха гавань", 2340 грн.
Диван - "Мудрість віків", 7340.57 грн.
Столик - "Місце роздумів", 4340 грн.

Загаьна сумма: 14020.57 грн.

------------------

Який варіант набору Ви хотіли б придбати ?

1 -> Ар-деко
2 -> Вікторіанській
3 -> Модерн

------------------

Ви обрали варіант: 3

Детальний опис:

Крісло - "Стар шіп", 1340 грн.
Диван - "Гіпер портал", 5340.17 грн.
Столик - "Пульт керування", 4340 грн.
Загаьна сумма: 11020.17 грн.
 */

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner scanner=new Scanner(System.in);
        ArtDeco_Furniture artDeco_furniture=new ArtDeco_Furniture();
        Victorian_Furniture victorian_furniture=new Victorian_Furniture();
        Modern_Furniture modern_furniture=new Modern_Furniture();

        System.out.println("Який варіант набору Ви хотіли б придбати ?");
        System.out.println("1 -> Ар-деко");
        System.out.println("2 -> Вікторіанській");
        System.out.println("3 -> Модерн");

        int whatWant=scanner.nextInt();

        switch (whatWant) {
            case 1:
                artDeco_furniture.enterInformation();
                break;
            case 2:
                victorian_furniture.enterInformation();
                break;
            case 3:
                modern_furniture.enterInformation();
                break;
        }
    }
}
